2D_riblet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 #includeIfPresent "../parameters.dat"


convertToMeters 1e-6;

surfaceX_nc 22;
arcX_nc 8;

arcY_nc 8;
upperY_nc 14;


vertices
(
	(-420.000  0.000  0.000)	 //vertex 0
	(-105.000  0.000  0.000)	 //vertex 1
	(-42.000  0.000  0.000)	 //vertex 2
	(-29.698  29.698  0.000)	 //vertex 3
	(0.000  42.000  0.000)	 //vertex 4
	(29.698  29.698  0.000)	 //vertex 5
	(42.000  0.000  0.000)	 //vertex 6
	(105.000  0.000  0.000)	 //vertex 7
	(420.000  0.000  0.000)	 //vertex 8
	(-420.000  74.246  0.000)	 //vertex 9
	(-74.246  74.246  0.000)	 //vertex 10
	(0.000  105.000  0.000)	 //vertex 11
	(74.246  74.246  0.000)	 //vertex 12
	(420.000  74.246  0.000)	 //vertex 13
	(-420.000  200.000  0.000)	 //vertex 14
	(-74.246  200.000  0.000)	 //vertex 15
	(0.000  200.000  0.000)	 //vertex 16
	(74.246  200.000  0.000)	 //vertex 17
	(420.000  200.000  0.000)	 //vertex 18
	(-420.000  0.000  1.000)	 //vertex 19
	(-105.000  0.000  1.000)	 //vertex 20
	(-42.000  0.000  1.000)	 //vertex 21
	(-29.698  29.698  1.000)	 //vertex 22
	(0.000  42.000  1.000)	 //vertex 23
	(29.698  29.698  1.000)	 //vertex 24
	(42.000  0.000  1.000)	 //vertex 25
	(105.000  0.000  1.000)	 //vertex 26
	(420.000  0.000  1.000)	 //vertex 27
	(-420.000  74.246  1.000)	 //vertex 28
	(-74.246  74.246  1.000)	 //vertex 29
	(0.000  105.000  1.000)	 //vertex 30
	(74.246  74.246  1.000)	 //vertex 31
	(420.000  74.246  1.000)	 //vertex 32
	(-420.000  200.000  1.000)	 //vertex 33
	(-74.246  200.000  1.000)	 //vertex 34
	(0.000  200.000  1.000)	 //vertex 35
	(74.246  200.000  1.000)	 //vertex 36
	(420.000  200.000  1.000)	 //vertex 37

);


blocks
(
	hex (0 1 10 9 19 20 29 28) 	($surfaceX_nc $arcX_nc 1) 	simpleGrading (1 1 1)      	//riblet 0, block 0
	hex (2 3 10 1 21 22 29 20) 	($arcX_nc $arcY_nc 1) 	simpleGrading (1 1 1)      	//riblet 0, block 1
	hex (3 4 11 10 22 23 30 29) 	($arcX_nc $arcY_nc 1) 	simpleGrading (1 1 1)      	//riblet 0, block 2
	hex (4 5 12 11 23 24 31 30) 	($arcX_nc $arcY_nc 1) 	simpleGrading (1 1 1)      	//riblet 0, block 3
	hex (5 6 7 12 24 25 26 31) 	($arcX_nc $arcY_nc 1) 	simpleGrading (1 1 1)      	//riblet 0, block 4
	hex (7 8 13 12 26 27 32 31) 	($surfaceX_nc $arcX_nc 1) 	simpleGrading (1 1 1)      	//riblet 0, block 5
	hex (9 10 15 14 28 29 34 33) 	($surfaceX_nc $upperY_nc 1) 	simpleGrading (1 1 1)      	//riblet 0, block 6
	hex (10 11 16 15 29 30 35 34) 	($arcX_nc $upperY_nc 1) 	simpleGrading (1 1 1)      	//riblet 0, block 7
	hex (11 12 17 16 30 31 36 35) 	($arcX_nc $upperY_nc 1) 	simpleGrading (1 1 1)      	//riblet 0, block 8
	hex (12 13 18 17 31 32 37 36) 	($surfaceX_nc $upperY_nc 1) 	simpleGrading (1 1 1)      	//riblet 0, block 9



);


edges
(
 arc   2   3	(-38.803  16.073  0.000)
 arc   3   4	(-16.073  38.803  0.000)
 arc   4   5	(16.073  38.803  0.000)
 arc   5   6	(38.803  16.073  0.000)
 arc   1  10	(-97.007  40.182  0.000)
 arc  10  11	(-40.182  97.007  0.000)
 arc  11  12	(40.182  97.007  0.000)
 arc  12   7	(97.007  40.182  0.000)
 arc  21  22	(-38.803  16.073  1.000)
 arc  22  23	(-16.073  38.803  1.000)
 arc  23  24	(16.073  38.803  1.000)
 arc  24  25	(38.803  16.073  1.000)
 arc  20  29	(-97.007  40.182  1.000)
 arc  29  30	(-40.182  97.007  1.000)
 arc  30  31	(40.182  97.007  1.000)
 arc  31  26	(97.007  40.182  1.000)

);


boundary
(
	ribletSurface
	{
		type wall;
		faces
		(
		(0 19 20 1)
		(1 20 21 2)
		(2 21 22 3)
		(3 22 23 4)
		(4 23 24 5)
		(5 24 25 6)
		(6 25 26 7)
		(7 26 27 8)
		);
	}

	roof
	{
		type patch;
		faces
		(
		(14 15 34 33)
		(15 16 35 34)
		(16 17 36 35)
		(17 18 37 36)
		);
	}

	inlet
	{
		type patch;
		faces
		(
		(0 9 28 19)
		(9 14 33 28)
		);
	}

	outlet
	{
		type patch;
		faces
		(
		(8 27 32 13)
		(13 32 37 18)
		);
	}

);


mergePatchPairs();
