2D_riblet/0/alpha.biofilm.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

contact_angle 90;

boundaryField
{
    inlet
    {
      type            inletOutlet;
      inletValue      uniform 0;
      value           uniform 0;
    }

    outlet
    {
      type            inletOutlet;
      inletValue      uniform 0;
      value           uniform 0;
    }

    ribletSurface
    {
        type           constantAlphaContactAngle;
        theta0         $contact_angle;
        limit          gradient;
        value          uniform 0;
    }

    roof
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }



    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
